var btn = document.getElementById('btn');
var output =document.getElementById('output');
var quotes = 
    [
        `قال الرّسول -صلّى الله عليه وسلّم-: (من كانتِ الآخرةُ هَمَّهُ جعلَ اللَّهُ غناهُ في قلبِهِ وجمعَ لَه شملَهُ وأتتهُ الدُّنيا وَهيَ راغمة، ومن كانتِ الدُّنيا همَّهُ جعلَ اللَّهُ فقرَهُ بينَ عينيهِ وفرَّقَ عليهِ شملَهُ، ولم يأتِهِ منَ الدُّنيا إلَّا ما قُدِّرَ لَهُ)`,
   
        `قال الرّسول -صلّى الله عليه وسلّم-: (إن كنتُم تحبُّونَ حِلْيَةَ الجنَّةِ و حريرَها فلا تلبَسوها في الدُّنيا)`,
       
        `قال الرّسول -صلّى الله عليه وسلّم-: (واللَّهِ ما الدُّنْيا في الآخِرَةِ إلَّا مِثْلُ ما يَجْعَلُ أحَدُكُمْ إصْبَعَهُ هذِه، وأَشارَ يَحْيَى بالسَّبَّابَةِ، في اليَمِّ، فَلْيَنْظُرْ بمَ تَرْجِعُ؟)`,
      
       
        `قال الرّسول -صلّى الله عليه وسلّم-: (يُنادِي مُنادٍ: إنَّ لَكُمْ أنْ تَصِحُّوا فلا تَسْقَمُوا أبَدًا، وإنَّ لَكُمْ أنْ تَحْيَوْا فلا تَمُوتُوا أبَدًا، وإنَّ لَكُمْ أنْ تَشِبُّوا فلا تَهْرَمُوا أبَدًا، وإنَّ لَكُمْ أنْ تَنْعَمُوا فلا تَبْأَسُوا أبَدًا).]`,
       
        `قال الرّسول -صلّى الله عليه وسلّم-: (إن في الجنةِ لشجرةً يسيرُ الراكبُ في ظلّها مائةَ عامٍ لا يقطعُها واقرأوا إن شئتُم وْظِلٍّ مَمْدُودٍ وَمَاءٍ مَسْكُوب)`,
        
        `سُئل الرّسول -صلّى الله عليه وسلّم- عن الجنّة فقال: (لبِنةٌ من فضَّةٍ ولبنةٌ من ذَهَبٍ، وملاطُها المسكُ الأذفرُ، وحصباؤُها اللُّؤلؤُ والياقوتُ، وتُربتُها الزَّعفرانُ مَن دخلَها ينعَمُ ولا يبأسُ، ويخلدُ ولا يموتُ، لا تبلَى ثيابُهُم، ولا يفنى شَبابُهُم).`,
        
        `قال الرسول -صلّى الله عليه وسلّم-: (من أُعطِيَ حظَّه من الرِّفقِ فقد أُعطِيَ حظَّه من الخيرِ ومن حُرِمَ حظُّه من الرِّفقِ ؛ فقد حُرِمَ حظُّه من الخيرِ . أثقلٌ شيءٍ في ميزانِ المؤمنِ يومَ القيامةِ حُسنُ الخُلُقِ ، وإنَّ اللهَ لَيبغضُ الفاحشَ البذِيءَ)`,
        
        `قال الرّسول -صلّى الله عليه وسلّم-: (ثَلَاثٌ مَن كُنَّ فيه وجَدَ حَلَاوَةَ الإيمَانِ: أنْ يَكونَ اللَّهُ ورَسولُهُ أحَبَّ إلَيْهِ ممَّا سِوَاهُمَا، وأَنْ يُحِبَّ المَرْءَ لا يُحِبُّهُ إلَّا لِلَّهِ، وأَنْ يَكْرَهَ أنْ يَعُودَ في الكُفْرِ كما يَكْرَهُ أنْ يُقْذَفَ في النَّارِ)`,
        
        `قال الرّسول -صلّى الله عليه وسلّم-: (لا يُؤْمِنُ أحدُكم حتى أكونَ أحبَّ إليه من ولدِهِ، ووالدِهِ، والناسِ أجمعينَ)`,
        
        `قال الرّسول -صلّى الله عليه وسلّم-: (إذا أحبَّ الرجلُ أخاه فلْيخبره أنّه يحبُّه)`,
       
        `قال الرّسول -صلّى الله عليه وسلّم-:(لا تَدْخُلُونَ الجَنَّةَ حتَّى تُؤْمِنُوا، ولا تُؤْمِنُوا حتَّى تَحابُّوا، أوَلا أدُلُّكُمْ علَى شيءٍ إذا فَعَلْتُمُوهُ تَحابَبْتُمْ؟ أفْشُوا السَّلامَ بيْنَكُمْ)`,
        
        `قال الرّسول -صلّى الله عليه وسلّم-: (لَا يُؤْمِنُ أحَدُكُمْ، حتَّى يُحِبَّ لأخِيهِ ما يُحِبُّ لِنَفْسِهِ)`,
        
        `قال الرّسول -صلّى الله عليه وسلّم-: (واللَّهِ ما الدُّنْيا في الآخِرَةِ إلَّا مِثْلُ ما يَجْعَلُ أحَدُكُمْ إصْبَعَهُ هذِه، وأَشارَ يَحْيَى بالسَّبَّابَةِ، في اليَمِّ، فَلْيَنْظُرْ بمَ تَرْجِعُ؟)`,
       
        `قال الرّسول -صلّى الله عليه وسلّم-: (لو كانتِ الدُّنيا تعدلُ عندَ اللهِ جناحَ بعوضةٍ ما سقى كافرًا منها شربةَ ماءٍ)`
    
    ];
btn.addEventListener('click', function(){
    var randomQuotes = quotes[Math.floor(Math.random()*quotes.length)]
    output.innerHTML = randomQuotes ;
}  
) 